src/Documents/МонтажКабельнойПродукции/МонтажКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МонтажКабельнойПродукции</name>
  <basedOn>Document.ЗаявкиНаЗакупки</basedOn>
  <registerRecords>InformationRegister.ДанныеПоМонтажуКабельнойПродукции</registerRecords>
  <attributes>
    <name>ОтчетОМонтаже</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖЧерновик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМонтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/СтатусыМонтажа/СтатусыМонтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМонтажа</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/МонтажКабельнойПродукции/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		Если Не РазрешенМонтаж() Тогда
			ОбщегоНазначения.СообщитьПользователю("Нет разрешения на монтаж по журналу: " + ЖурналУчетаКабельнойПродукции,,,, Отказ);	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоОтменаМонтажа() И СтатусыПроверкаСервер.ЖурналКабельнойЛинииПодписан(ЖурналУчетаКабельнойПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Работа сдана, нельзя отменить документ!",,,, Отказ);	
	КонецЕсли;	
	
КонецПроцедуры  

Функция РазрешенМонтаж()
	
	Возврат ЖурналУчетаКабельнойПродукции.РазрешитьМонтаж;	
	
КонецФункции

Функция ЭтоОтменаМонтажа()
	
	ТекущийСтатусВыполнен = (Ссылка.Статус = Перечисления.СтатусыМонтажа.Выполнен);
	СменаСтатуса          = (Статус <> Ссылка.Статус);
	
	Возврат ТекущийСтатусВыполнен И СменаСтатуса;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДанныеПоМонтажуКабельнойПродукции.Записывать = Истина;
	
	НоваяЗапись = Движения.ДанныеПоМонтажуКабельнойПродукции.Добавить();
	НоваяЗапись.Период                    = Дата;
	НоваяЗапись.ЖурналУчетаКабельнойЛинии = ЖурналУчетаКабельнойПродукции;    
	НоваяЗапись.Подрядчик                 = Подрядчик;
	НоваяЗапись.Статус                    = Статус; 
	НоваяЗапись.ДлинаФактическая          = ДлинаФактическая; 
	НоваяЗапись.Исполнитель               = Исполнитель;
	
КонецПроцедуры
